cf_billing/Enums/энргПричиныОтклоненияПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргПричиныОтклоненияПоказаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасходПревышаетМаксимальноДопустимыйОбъем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтрицательныйРасход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненыПользователем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретПриемаВПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктНедопуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоказанияПредоставленыНеВСрок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаДругойЗоны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПрибораУчетаИстекМПИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АбонентОтсутствует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СомнительныеПоказания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПрофиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НекорректнаяРазрядность</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/энргСостояниеПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеПоказаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приняты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/CommonModules/энргРаботаСПоказаниямиПриборовУчетаКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Перечитывает строку приборов учета.
//
// Параметры:
//  ТекСтрока					-	ДанныеФормыЭлементКоллекции.
//  ПериодНачисления			-	Дата.
//  КонтрольныйСъем				-	Булево.
//  ДополнительныеПараментры	-	Структура
//
Процедура ПересчитатьСтрокуПриборовУчета(ТекСтрока, ПериодНачисления, КонтрольныйСъем = Ложь, ДополнительныеПараментры = Неопределено) Экспорт 
	
	// Причины отклонения показаний
	ОтрицательныйРасход 						= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ОтрицательныйРасход");
	ИстекСрокМПИ 								= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.УПрибораУчетаИстекМПИ");
	ОРП											= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ОРП");
	АбонентОтсутствует							= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.АбонентОтсутствует");
	ЗапретПриемаВПУ 							= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ЗапретПриемаВПУ");
	АктНедопуска 								= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.АктНедопуска");
	РасходПревышаетМаксимальноДопустимыйОбъем 	= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.РасходПревышаетМаксимальноДопустимыйОбъем");
		
	ПоказанияЗа 					= ?(НачалоМесяца(ТекСтрока.ДатаПоследнихПоказаний) - ПериодНачисления = 0 ,1,1 + 
		Цел((ПериодНачисления - ТекСтрока.ДатаПоследнихПоказаний) / (30*86400)));
		
	МаксимальныеВозможныеПоказания 	= pow(10,СтрДлина(СтрЗаменить(СтрЗаменить(ТекСтрока.ПредыдущиеПоказания,Символы.НПП,"")," ","")));
	Расход 							= ТекСтрока.ТекущиеПоказания - ТекСтрока.ПредыдущиеПоказания;
	РасходСПереворотом 				= ТекСтрока.МаксимальноВозможныеПоказания - ТекСтрока.ПредыдущиеПоказания + ТекСтрока.ТекущиеПоказания;
	РасходПоМодулю 					= ?(ТекСтрока.ТекущиеПоказания>ТекСтрока.ПредыдущиеПоказания,ТекСтрока.ТекущиеПоказания - 
		ТекСтрока.ПредыдущиеПоказания,ТекСтрока.ПредыдущиеПоказания -ТекСтрока.ТекущиеПоказания);
	
	Если ТекСтрока.СтатусИзмененПользователем И ТекСтрока.СостояниеПоказаний = ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены") Тогда
		ТекСтрока.Разница 			= ?(ТекСтрока.Переворот, РасходСПереворотом, Расход);	
		ТекСтрока.ПричинаОтклонения	= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ОтклоненыПользователем"); 
		ТекСтрока.Сумма 				= ТекСтрока.Разница * ТекСтрока.ЗначениеТарифа; 				
		Возврат;
	КонецЕсли; 
	
	Если ТекСтрока.ПереворотИзмененПользователем  Тогда 
		Если ТекСтрока.Переворот Тогда			
			ТекСтрока.Разница 				= РасходСПереворотом;
			ТекСтрока.Сумма 				= ТекСтрока.Разница * ТекСтрока.ЗначениеТарифа;			
			ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
			ТекСтрока.ПричинаОтклонения		= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка");
			Возврат;			
		КонецЕсли;
	КонецЕсли;
	
	Если ТекСтрока.ПредыдущиеПоказания < 0 Тогда 
		ТекСтрока.ПредыдущиеПоказания = 0;
	КонецЕсли;
	
	Если ТекСтрока.ПричинаОтклонения = ИстекСрокМПИ Тогда	
		ТекСтрока.Разница 						= Расход;
		ТекСтрока.Переворот 					= Ложь;
		ТекСтрока.СостояниеПоказаний 			= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		ТекСтрока.ПричинаОтклонения				= ИстекСрокМПИ;
		ТекСтрока.СтатусИзмененПользователем 	= Ложь;
	ИначеЕсли ТекСтрока.ПричинаОтклонения = ОРП Тогда	
		ТекСтрока.Разница 						= Расход;
		ТекСтрока.Переворот 					= Ложь;
		ТекСтрока.СостояниеПоказаний 			= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		ТекСтрока.ПричинаОтклонения				= ОРП;
		ТекСтрока.СтатусИзмененПользователем 	= Ложь;
	ИначеЕсли ТекСтрока.ПричинаОтклонения = АбонентОтсутствует Тогда 	
		ТекСтрока.Разница 						= Расход;
		ТекСтрока.Переворот 					= Ложь;
		ТекСтрока.СостояниеПоказаний 			= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		ТекСтрока.ПричинаОтклонения				= АбонентОтсутствует; 
		ТекСтрока.СтатусИзмененПользователем 	= Ложь;
	ИначеЕсли ТекСтрока.ПричинаОтклонения = ЗапретПриемаВПУ И Не ТекСтрока.СтатусИзмененПользователем Тогда	
		ТекСтрока.СостояниеПоказаний 			= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		ТекСтрока.ПричинаОтклонения				= ЗапретПриемаВПУ;
		ТекСтрока.СтатусИзмененПользователем 	= Ложь;
	ИначеЕсли ТекСтрока.ПричинаОтклонения = АктНедопуска Тогда
		ТекСтрока.Разница 						= Расход;
		ТекСтрока.Переворот 					= Ложь;
		ТекСтрока.СостояниеПоказаний 			= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		ТекСтрока.ПричинаОтклонения				= АктНедопуска;	
		ТекСтрока.СтатусИзмененПользователем 	= Ложь;
	ИначеЕсли Расход >= 0 И КонтрольныйСъем Тогда
		ТекСтрока.Разница 						= Расход;
		ТекСтрока.Переворот 					= Ложь;
		ТекСтрока.СостояниеПоказаний 			= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
		ТекСтрока.ПричинаОтклонения				= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка");	
	ИначеЕсли КонтрольныйСъем Тогда
		ТекСтрока.Разница 						= Расход;
		ТекСтрока.Переворот 					= Ложь;
		ТекСтрока.СостояниеПоказаний 			= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		ТекСтрока.ПричинаОтклонения				= ОтрицательныйРасход;
		ТекСтрока.СтатусИзмененПользователем 	= Ложь;
	ИначеЕсли Расход >= 0 И Расход <= ТекСтрока.МаксимальноВозможныйОбъемПотребления Тогда 	
		ТекСтрока.Разница 						= Расход;
		ТекСтрока.Переворот 					= Ложь;
		ТекСтрока.СостояниеПоказаний 			= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
		ТекСтрока.ПричинаОтклонения				= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка");
	ИначеЕсли Расход >= 0 И ТекСтрока.МаксимальноВозможныйОбъемПотребления = 0 Тогда 	
		ТекСтрока.Разница 						= Расход;
		ТекСтрока.Переворот 					= Ложь;
		ТекСтрока.СостояниеПоказаний 			= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
		ТекСтрока.ПричинаОтклонения				= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка");
	ИначеЕсли Расход >= 0 И ТекСтрока.СтатусИзмененПользователем Тогда 	
		ТекСтрока.Разница 						= Расход;
		ТекСтрока.Переворот 					= Ложь;
		ТекСтрока.СостояниеПоказаний 			= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
		ТекСтрока.ПричинаОтклонения				= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ПустаяСсылка");
	ИначеЕсли Расход >= 0 Тогда 	
		ТекСтрока.Разница 						= Расход;
		ТекСтрока.Переворот 					= Ложь;
		ТекСтрока.СостояниеПоказаний 			= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		ТекСтрока.ПричинаОтклонения				= РасходПревышаетМаксимальноДопустимыйОбъем;
		ТекСтрока.СтатусИзмененПользователем 	= Ложь;
	Иначе 
		ТекСтрока.Разница 						= РасходПоМодулю;
		ТекСтрока.Переворот 					= Ложь;
		ТекСтрока.СостояниеПоказаний 			= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		ТекСтрока.ПричинаОтклонения				= ОтрицательныйРасход; 
		ТекСтрока.СтатусИзмененПользователем 	= Ложь;
	КонецЕсли;  	
	
	ТекСтрока.Сумма	= ТекСтрока.Разница * ТекСтрока.ЗначениеТарифа;
	
КонецПроцедуры

// Перечитывает строку с объемом.
//
// Параметры:
//  ТекущиеДанные		-	ДанныеФормыЭлементКоллекции.
//  ПериодНачисления	-	Дата.
//  КонтрольныйСъем		-	Булево.
//
Процедура ПеречитатьСтрокуСОбъемом(ТекущиеДанные,ПериодНачисления,КонтрольныйСъем = ложь) Экспорт
	
	МаксимальныйРасходЗаПериод 				= ТекущиеДанные.МаксимальноВозможныйОбъемПотребления ;
	
	Расход 									= ТекущиеДанные.Разница; 
	
	Если ТекущиеДанные.СтатусИзмененПользователем И ТекущиеДанные.СостояниеПоказаний = ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены") Тогда	
		ТекущиеДанные.ПричинаОтклонения	= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ОтклоненыПользователем"); 
		ТекущиеДанные.Сумма 				= ТекущиеДанные.Разница * ТекущиеДанные.ЗначениеТарифа; 				
		Возврат; 
	КонецЕсли;
	
	Если КонтрольныйСъем  Тогда
		ТекущиеДанные.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
	ИначеЕсли Расход >= 0 И Расход < МаксимальныйРасходЗаПериод Тогда	
		ТекущиеДанные.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
	ИначеЕсли Расход >= 0 и МаксимальныйРасходЗаПериод = 0 Тогда	
		ТекущиеДанные.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
	ИначеЕсли Расход < 0 Тогда
		ТекущиеДанные.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		ТекущиеДанные.ПричинаОтклонения		= ПредопределенноеЗначение("Перечисление.энргПричиныОтклоненияПоказаний.ОтрицательныйРасход");
	Иначе 	
		ТекущиеДанные.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
	КонецЕсли;  	
	
	ТекущиеДанные.Сумма 					= ТекущиеДанные.Разница * ТекущиеДанные.ЗначениеТарифа;
	
КонецПроцедуры

// Возвращает данные строки показаний.
//
// Возвращаемое значение:
//   Структура.
//
Функция  ДанныеСтрокиПоказаний() Экспорт 	
	ДанныеСтроки  = Новый Структура;
	ДанныеСтроки.Вставить("ПредыдущиеПоказания");
	ДанныеСтроки.Вставить("ДатаПоследнихПоказаний");
	ДанныеСтроки.Вставить("СостояниеПоказаний");
	ДанныеСтроки.Вставить("ТекущиеПоказания");
	ДанныеСтроки.Вставить("СреднийОбъемПотребления");
	ДанныеСтроки.Вставить("МаксимальноВозможныеПоказания");
	ДанныеСтроки.Вставить("МаксимальноВозможныйОбъемПотребления"); 
	ДанныеСтроки.Вставить("КоэффициентПУ"); 
	ДанныеСтроки.Вставить("Разница");
	ДанныеСтроки.Вставить("Переворот");
	ДанныеСтроки.Вставить("СостояниеПоказаний");
	ДанныеСтроки.Вставить("ПричинаОтклонения");
	ДанныеСтроки.Вставить("ПереворотИзмененПользователем");
	ДанныеСтроки.Вставить("СтатусИзмененПользователем");
	ДанныеСтроки.Вставить("ЗначениеТарифа");
	ДанныеСтроки.Вставить("Сумма");
	Возврат ДанныеСтроки;   	
КонецФункции

// Возвращает данные строки показаний МКД.
// 
// Возвращаемое значение:
//   Структура.
//
Функция  ДанныеСтрокиПоказанийМКД() Экспорт 	
	ДанныеСтроки  = Новый Структура;
	ДанныеСтроки.Вставить("ПредыдущиеПоказания");
	ДанныеСтроки.Вставить("ДатаПоследнихПоказаний");
	ДанныеСтроки.Вставить("СостояниеПоказаний");
	ДанныеСтроки.Вставить("ТекущиеПоказания");
	ДанныеСтроки.Вставить("СреднийОбъемПотребления");
	ДанныеСтроки.Вставить("МаксимальноВозможныеПоказания");
	ДанныеСтроки.Вставить("МаксимальноВозможныйОбъемПотребления"); 
	ДанныеСтроки.Вставить("КоэффициентПУ"); 
	ДанныеСтроки.Вставить("Разница");
	ДанныеСтроки.Вставить("Переворот");
	ДанныеСтроки.Вставить("СостояниеПоказаний");
	ДанныеСтроки.Вставить("ПереворотИзмененПользователем");
	ДанныеСтроки.Вставить("СтатусИзмененПользователем");
	Возврат ДанныеСтроки;   	
КонецФункции

 //Пересчитывает строку приборов учета МКД.
//
// Параметры:
//  ТекСтрока					-	ДанныеФормыЭлементКоллекции.
//  ПериодНачисления			-	Дата.
//  КонтрольныйСъем				-	Булево.
//  ДополнительныеПараментры	-	Структура.
//
Процедура ПересчитатьСтрокуПриборовУчетаМКД(ТекСтрока,ПериодНачисления,КонтрольныйСъем = ложь, ДополнительныеПараментры = Неопределено) Экспорт
		
	ПоказанияЗа 						= ?(НачалоМесяца(ТекСтрока.ДатаПоследнихПоказаний) - ПериодНачисления = 0 ,1,1 + Цел((ПериодНачисления - ТекСтрока.ДатаПоследнихПоказаний) / (30*86400)));
	МаксимальныеВозможныеПоказания 		=  ТекСтрока.МаксимальноВозможныеПоказания;
	Расход 								= ТекСтрока.ТекущиеПоказания - ТекСтрока.ПредыдущиеПоказания;
	РасходСПереворотом 					= ТекСтрока.МаксимальноВозможныеПоказания - ТекСтрока.ПредыдущиеПоказания + ТекСтрока.ТекущиеПоказания;
	РасходПоМодулю 						= ?(ТекСтрока.ТекущиеПоказания>ТекСтрока.ПредыдущиеПоказания,ТекСтрока.ТекущиеПоказания - ТекСтрока.ПредыдущиеПоказания,ТекСтрока.ПредыдущиеПоказания -ТекСтрока.ТекущиеПоказания);
	
	Если ТекСтрока.СтатусИзмененПользователем Тогда
		Если ТекСтрока.СостояниеПоказаний = ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты") тогда
			ТекСтрока.Разница 			= ?(ТекСтрока.переворот,РасходСПереворотом,Расход);			
		иначе
			ТекСтрока.Разница 			= ?(ТекСтрока.переворот,РасходСПереворотом,Расход);			
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока.ПереворотИзмененПользователем  тогда
		Если ТекСтрока.Переворот тогда
			ТекСтрока.Разница 			= РасходСПереворотом;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекСтрока.ПредыдущиеПоказания < 0 тогда
		ТекСтрока.ПредыдущиеПоказания = 0;
	КонецЕсли;
	
	Если ТекСтрока.ПредыдущиеПоказания = 0 тогда
		ПорядокНачальных 				= 1;
	иначе
		ПорядокНачальных 				= СтрДлина(Строка(Цел(ТекСтрока.ПредыдущиеПоказания))) - 1;
	КонецЕсли;
	
	Если ТекСтрока.ТекущиеПоказания = 0 тогда
		ПорядокКонечных 				= 1;
	иначе
		ПорядокКонечных 				= СтрДлина(Строка(Цел(ТекСтрока.ТекущиеПоказания))) - 1;
	КонецЕсли;	 
	
	Если Расход < 0  и ПорядокНачальных = ПорядокКонечных тогда
		ТекСтрока.Разница 				= Расход;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		Возврат;
	КонецЕсли; 
	
	// определяем расход
	Если ТекСтрока.ТекущиеПоказания = 0 тогда
		ТекСтрока.Разница 				= 0;
		ТекСтрока.Переворот 			= ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
	ИначеЕсли КонтрольныйСъем и  Расход >=  0 тогда
		ТекСтрока.Разница 				= Расход;
		ТекСтрока.Переворот 			= ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
	ИначеЕсли КонтрольныйСъем  тогда
		ТекСтрока.Разница 				= Расход;
		ТекСтрока.Переворот 			= Ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
	ИначеЕсли Расход >= 0 тогда	
		ТекСтрока.Разница 				= Расход;
		ТекСтрока.Переворот 			= ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");	
	иначе
		ТекСтрока.Разница 				= -РасходПоМодулю;
		ТекСтрока.Переворот 			= ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
	КонецЕсли;    	
	
КонецПроцедуры

// Пересчитывает строку с объемом МКД.
//
// Параметры:
//  ТекущиеДанные		-	ДанныеФормыЭлементКоллекции.
//  ПериодНачисления	-	Дата.
//  КонтрольныйСъем		-	Булево.
//
Процедура ПеречитатьСтрокуСОбъемомМКД(ТекущиеДанные,ПериодНачисления,КонтрольныйСъем = ложь) Экспорт 	
	
	МаксимальныйРасходЗаПериод 				= ТекущиеДанные.МаксимальноВозможныйОбъемПотребления ;
	
	Расход 									= ТекущиеДанные.Разница;
	
	Если КонтрольныйСъем  Тогда
		ТекущиеДанные.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
	ИначеЕсли Расход >= 0 И Расход < МаксимальныйРасходЗаПериод тогда	
		ТекущиеДанные.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
	ИначеЕсли Расход >= 0 и МаксимальныйРасходЗаПериод = 0 тогда	
		ТекущиеДанные.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
	иначе
		ТекущиеДанные.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
	КонецЕсли;
	
КонецПроцедуры

// Пересчитывает строку приборов учета теплоисточника.
//
// Параметры:
//  ТекСтрока			-	ДанныеФормыЭлементКоллекции.
//  ПериодНачисления	-	Дата.
//  КонтрольныйСъем		-	Булево.
//
Процедура ПересчитатьСтрокуПриборовУчетаТеплоисточника(ТекСтрока,ПериодНачисления,КонтрольныйСъем = ложь) Экспорт 
	
	ПоказанияЗа 						= ?(НачалоМесяца(ТекСтрока.ДатаПоследнихПоказаний) - ПериодНачисления = 0 ,1,1 + Цел((ПериодНачисления - ТекСтрока.ДатаПоследнихПоказаний) / (30*86400)));
	МаксимальныеВозможныеПоказания 		=  ТекСтрока.МаксимальноВозможныеПоказания;
	Расход 								= ТекСтрока.ТекущиеПоказания - ТекСтрока.ПредыдущиеПоказания;
	РасходСПереворотом 					= ТекСтрока.МаксимальноВозможныеПоказания - ТекСтрока.ПредыдущиеПоказания + ТекСтрока.ТекущиеПоказания;
	РасходПоМодулю 						= ?(ТекСтрока.ТекущиеПоказания>ТекСтрока.ПредыдущиеПоказания,ТекСтрока.ТекущиеПоказания - ТекСтрока.ПредыдущиеПоказания,ТекСтрока.ПредыдущиеПоказания -ТекСтрока.ТекущиеПоказания);
	
	Если ТекСтрока.СтатусИзмененПользователем  тогда
		Если ТекСтрока.СостояниеПоказаний = ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты") тогда
			ТекСтрока.Разница 			= ?(ТекСтрока.переворот,РасходСПереворотом,Расход);			
		иначе
			ТекСтрока.Разница 			= ?(ТекСтрока.переворот,РасходСПереворотом,Расход);			
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока.ПереворотИзмененПользователем  тогда
		Если ТекСтрока.Переворот тогда
			ТекСтрока.Разница 			= РасходСПереворотом;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекСтрока.ПредыдущиеПоказания < 0 тогда
		ТекСтрока.ПредыдущиеПоказания = 0;
	КонецЕсли;
	
	Если ТекСтрока.ПредыдущиеПоказания = 0 тогда
		ПорядокНачальных 				= 1;
	иначе
		ПорядокНачальных 				= СтрДлина(Строка(Цел(ТекСтрока.ПредыдущиеПоказания))) - 1;
	КонецЕсли;
	
	Если ТекСтрока.ТекущиеПоказания = 0 тогда
		ПорядокКонечных 				= 1;
	иначе
		ПорядокКонечных 				= СтрДлина(Строка(Цел(ТекСтрока.ТекущиеПоказания))) - 1;
	КонецЕсли;	 
	
	Если Расход < 0  и ПорядокНачальных = ПорядокКонечных тогда
		ТекСтрока.Разница 				= Расход;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
		Возврат;
	КонецЕсли; 
	
	// определяем расход
	Если ТекСтрока.ТекущиеПоказания = 0 тогда
		ТекСтрока.Разница 				= 0;
		ТекСтрока.Переворот 			= ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
	ИначеЕсли КонтрольныйСъем и  Расход >=  0 тогда
		ТекСтрока.Разница 				= Расход;
		ТекСтрока.Переворот 			= ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");
	ИначеЕсли КонтрольныйСъем  тогда
		ТекСтрока.Разница 				= Расход;
		ТекСтрока.Переворот 			= Ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");	
	ИначеЕсли Расход > 0 тогда	
		ТекСтрока.Разница 				= Расход;
		ТекСтрока.Переворот 			= ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Приняты");	
	иначе
		ТекСтрока.Разница 				= -РасходПоМодулю;
		ТекСтрока.Переворот 			= ложь;
		ТекСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены");
	КонецЕсли;    	
	
	ТекСтрока.Сумма 					= ТекСтрока.Разница * ТекСтрока.ЗначениеТарифа;
	
	
КонецПроцедуры

#КонецОбласти
